buttons = {
    "PLAY": "Играть",
    "EXIT": "Выход",
    "GASPERS_GUN": "Ружьё Гаспера",
    "NO_PRESET": "Без пресетов",
    "GLIDER": "Глайдер"
}


errors = {
    "NOT_GASPERS_GUN": "Файл с ружьём Гаспера не найден. Использую стандартную сетку.",
    "NOT_GLIDER": "Файл с глайдером не найден. Использую стандартную сетку."
}

shapes = {
    "SQUARE": "Квадрат",
    "HEXAGON": "Шестиугольник"
}


colors = {
    "CLASSIC": "Классическая",
    "NEON": "Неоновая",
    "FIRE": "Огненная",
    "SEA": "Морская",
    "MYSTIC": "Мистическая"
}


titles = {
    "SHAPE_SELECT": "Выберите форму ячеек",
    "PRESET_SELECT": "Выберите пресет",
    "COLOR_SELECT": "Выберите цветовую схему"
}


ui = {
    "CONTROLS": "SPACE старт/пауза | S/→ шаг | R сброс | C очистка | L загрузка | F сохранить | +/- скорость | Q выход",
    "RUN": "RUN",
    "PAUSE": "PAUSE"
}
